In [1]:
import pandas as pd

In [2]:
s = pd.Series([11,25,36,55])

In [3]:
s

0    11
1    25
2    36
3    55
dtype: int64

In [4]:
type(s)

pandas.core.series.Series

In [5]:
df = pd.DataFrame(s)

In [6]:
df

    0
0  11
1  25
2  36
3  55

In [7]:
import numpy as np
a = np.array([11,25,13,54])

In [8]:
df = pd.DataFrame(a, columns=["Numbers"])

In [9]:
df

   Numbers
0       11
1       25
2       13
3       54

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(a),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [12]:
df2

     A          B   C  D      E    F
0  1.0 2013-01-02  11  3   test  foo
1  1.0 2013-01-02  25  3  train  foo
2  1.0 2013-01-02  13  3   test  foo
3  1.0 2013-01-02  54  3  train  foo

In [13]:
D= pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20240718"),
        "C": 3.22,
        "D": pd.array([1,2,3,4]),
        "E": pd.Categorical(["ASD","FGH","JKL","ZXC"]),
        "F": "BGMI",
    }
)

In [14]:
D

     A          B     C  D    E     F
0  1.0 2024-07-18  3.22  1  ASD  BGMI
1  1.0 2024-07-18  3.22  2  FGH  BGMI
2  1.0 2024-07-18  3.22  3  JKL  BGMI
3  1.0 2024-07-18  3.22  4  ZXC  BGMI

In [15]:
D = pd.DataFrame({"Name": ["Nitin","Amrit","Pawan"],"Age": [19,20,20]})

In [16]:
D

    Name  Age
0  Nitin   19
1  Amrit   20
2  Pawan   20

In [17]:
ff= pd.read_csv("student_clustering.csv")

In [18]:
ff

     cgpa   iq
0    5.13   88
1    5.90  113
2    8.36   93
3    8.27   97
4    5.45  110
..    ...  ...
195  4.68   89
196  8.57  118
197  5.85  112
198  6.23  108
199  8.82  117

[200 rows x 2 columns]

In [19]:
ff.describe()

             cgpa          iq
count  200.000000  200.000000
mean     6.983400  101.995000
std      1.624101   12.161599
min      4.600000   83.000000
25%      5.407500   91.000000
50%      7.040000  102.000000
75%      8.585000  113.000000
max      9.300000  121.000000

In [20]:
ff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cgpa    200 non-null    float64
 1   iq      200 non-null    int64
dtypes: float64(1), int64(1)
memory usage: 3.3 KB

In [21]:
ff.duplicated().sum()

7

In [22]:
ff[ff.duplicated()]

     cgpa   iq
109  9.03  118
111  8.86  117
120  4.78   87
144  4.98   87
160  5.01   86
180  8.91  117
190  8.40   93

In [23]:
ff.sort_values(by="iq")

     cgpa   iq
73   5.28   83
132  5.01   83
50   5.14   83
38   5.44   84
141  4.81   85
..    ...  ...
27   9.18  119
103  8.91  119
161  8.97  119
170  9.06  120
81   9.01  121

[200 rows x 2 columns]

In [24]:
ff.sort_values(by="iq", ascending=False)

     cgpa   iq
81   9.01  121
170  9.06  120
169  8.68  119
103  8.91  119
27   9.18  119
..    ...  ...
83   4.90   85
38   5.44   84
132  5.01   83
73   5.28   83
50   5.14   83

[200 rows x 2 columns]

In [25]:
ff.columns

Index(['cgpa', 'iq'], dtype='object')

In [26]:
ff["cgpa"].values

array([5.13, 5.9 , 8.36, 8.27, 5.45, 5.88, 8.41, 8.8 , 5.79, 8.09, 4.6 ,
       6.1 , 8.16, 5.  , 5.71, 8.31, 5.5 , 7.87, 6.05, 5.84, 7.47, 4.86,
       7.78, 4.78, 4.96, 7.93, 4.86, 9.18, 8.04, 5.43, 8.86, 6.01, 8.83,
       5.32, 7.77, 8.  , 8.56, 5.91, 5.44, 5.57, 5.34, 8.43, 8.02, 5.31,
       8.96, 8.78, 8.14, 6.4 , 8.45, 5.67, 5.14, 4.95, 8.79, 8.12, 8.81,
       6.05, 5.85, 8.88, 5.87, 9.07, 6.02, 8.34, 8.65, 8.92, 5.21, 8.75,
       8.53, 4.91, 5.77, 8.29, 6.06, 8.71, 7.93, 5.28, 5.55, 8.86, 5.81,
       9.3 , 5.15, 8.72, 8.14, 9.01, 5.47, 4.9 , 8.97, 4.89, 9.  , 5.74,
       8.76, 5.8 , 8.78, 9.23, 8.2 , 5.05, 8.67, 8.18, 9.03, 8.61, 4.98,
       9.13, 5.88, 5.01, 4.95, 8.91, 4.96, 4.85, 7.99, 4.76, 8.98, 9.03,
       8.08, 8.86, 5.91, 5.67, 8.26, 8.89, 8.25, 5.74, 8.97, 4.98, 4.78,
       5.69, 8.4 , 8.72, 7.84, 5.2 , 8.08, 6.05, 5.05, 8.25, 8.3 , 6.14,
       5.01, 4.77, 5.74, 8.93, 5.94, 4.68, 7.9 , 7.97, 8.21, 4.81, 5.86,
       5.03, 4.98, 8.58, 5.32, 8.94, 6.38, 4.86, 8.6 , 4.89, 8.77, 8.81,
       4.88, 8.23, 6.61, 8.54, 6.04, 8.35, 5.01, 8.97, 6.24, 8.33, 8.91,
       4.67, 6.1 , 5.15, 4.97, 8.68, 9.06, 5.8 , 8.9 , 4.87, 5.2 , 8.46,
       8.94, 5.87, 4.99, 8.91, 8.91, 5.97, 6.17, 6.01, 7.89, 4.79, 7.91,
       8.23, 8.95, 6.33, 8.4 , 8.44, 4.76, 4.78, 8.79, 4.68, 8.57, 5.85,
       6.23, 8.82])

In [27]:
ff.drop_duplicates(inplace=True)

In [28]:
ff.duplicated().sum()

0

In [29]:
data={
    'Column1': [1,2,3,4,5],
    'Column2': ['A','B','C','D','E'],
    'Column3': [True, False, True, False, False]
}

In [30]:
df=pd.DataFrame(data)

In [31]:
df

   Column1 Column2  Column3
0        1       A     True
1        2       B    False
2        3       C     True
3        4       D    False
4        5       E    False

In [32]:
df['Column1']

0    1
1    2
2    3
3    4
4    5
Name: Column1, dtype: int64

In [33]:
df[2:4]

   Column1 Column2  Column3
2        3       C     True
3        4       D    False

In [34]:
df.iloc[0:2, 0:2]

   Column1 Column2
0        1       A
1        2       B

In [35]:
df.loc[2]

Column1       3
Column2       C
Column3    True
Name: 2, dtype: object

In [36]:
data={
    'Column1': [1,2,np.nan,4,5],
    'Column2': ['A','B',np.nan,'D','E'],
    'Column3': [True, False, np.nan, False, np.nan]
}

In [37]:
df2= pd.DataFrame(data)

In [38]:
df2

   Column1 Column2 Column3
0      1.0       A    True
1      2.0       B   False
2      NaN     NaN     NaN
3      4.0       D   False
4      5.0       E     NaN

In [39]:
df2.isnull().sum()

Column1    1
Column2    1
Column3    2
dtype: int64

In [40]:
df3=df2.dropna()

In [41]:
df3

   Column1 Column2 Column3
0      1.0       A    True
1      2.0       B   False
3      4.0       D   False

In [42]:
df4= df2.fillna(5)

In [43]:
df4

   Column1 Column2 Column3
0      1.0       A    True
1      2.0       B   False
2      5.0       5       5
3      4.0       D   False
4      5.0       E       5

In [44]:
df2

   Column1 Column2 Column3
0      1.0       A    True
1      2.0       B   False
2      NaN     NaN     NaN
3      4.0       D   False
4      5.0       E     NaN

In [45]:
df2['Column1'].fillna(5.0, inplace=True)
df2['Column2'].fillna('C', inplace=True)
df2['Column3'].fillna(True, inplace=True)

In [46]:
df2

   Column1 Column2  Column3
0      1.0       A     True
1      2.0       B    False
2      5.0       C     True
3      4.0       D    False
4      5.0       E     True

In [47]:
d={
    'Column1': [1,2,np.nan,4,5],
    'Column2': ['A','B',np.nan,'D','E'],
    'Column3': [True, False, np.nan, False, np.nan]
}

In [48]:
D= pd.DataFrame(d)

In [49]:
D

   Column1 Column2 Column3
0      1.0       A    True
1      2.0       B   False
2      NaN     NaN     NaN
3      4.0       D   False
4      5.0       E     NaN

In [50]:
mean=df2['Column1'].mean()

In [51]:
mean

3.4

In [52]:
D['Column1'].fillna(mean, inplace=True)
D

   Column1 Column2 Column3
0      1.0       A    True
1      2.0       B   False
2      3.4     NaN     NaN
3      4.0       D   False
4      5.0       E     NaN

In [53]:
D.value_counts()

Column1  Column2  Column3
1.0      A        True       1
2.0      B        False      1
4.0      D        False      1
Name: count, dtype: int64

In [54]:
D['Column3'].unique()

array([True, False, nan], dtype=object)

In [55]:
d1={
    'Column1': [1,2,3,4,5],
    'Column2': ['A','B','C','D','E'],
    'Column3': [True, False, True, False, True]
}
d1= pd.DataFrame(d1)

d2={
    'Column1': [11,12,13,14,15],
    'Column2': ['Aa','Bb','Cc','Dd','Ee'],
    'Column3': [True,  True, False, True,False]
}
d2=pd.DataFrame(d2)

In [56]:
d1

   Column1 Column2  Column3
0        1       A     True
1        2       B    False
2        3       C     True
3        4       D    False
4        5       E     True

In [57]:
d2

   Column1 Column2  Column3
0       11      Aa     True
1       12      Bb     True
2       13      Cc    False
3       14      Dd     True
4       15      Ee    False

In [58]:
pd.concat([d1,d2])

   Column1 Column2  Column3
0        1       A     True
1        2       B    False
2        3       C     True
3        4       D    False
4        5       E     True
0       11      Aa     True
1       12      Bb     True
2       13      Cc    False
3       14      Dd     True
4       15      Ee    False

In [59]:
pd.concat([d1,d2], axis=1)

   Column1 Column2  Column3  Column1 Column2  Column3
0        1       A     True       11      Aa     True
1        2       B    False       12      Bb     True
2        3       C     True       13      Cc    False
3        4       D    False       14      Dd     True
4        5       E     True       15      Ee    False

In [60]:
data1 = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve']
}
data2 = {
    'ID': [1, 2, 6, 7, 8],
    'Age': [25, 30, 35, 40, 45]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [61]:
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eve

In [62]:
df2

   ID  Age
0   1   25
1   2   30
2   6   35
3   7   40
4   8   45

In [63]:
mi= pd.merge(df1,df2, on='ID', how='inner')

In [64]:
mi

   ID   Name  Age
0   1  Alice   25
1   2    Bob   30

In [65]:
mo= pd.merge(df1,df2, on='ID', how='outer')
ml= pd.merge(df1,df2, on='ID', how='left')
mr= pd.merge(df1,df2, on='ID', how='right')

In [66]:
mo

   ID     Name   Age
0   1    Alice  25.0
1   2      Bob  30.0
2   3  Charlie   NaN
3   4    David   NaN
4   5      Eve   NaN
5   6      NaN  35.0
6   7      NaN  40.0
7   8      NaN  45.0

In [67]:
ml

   ID     Name   Age
0   1    Alice  25.0
1   2      Bob  30.0
2   3  Charlie   NaN
3   4    David   NaN
4   5      Eve   NaN

In [68]:
mr

   ID   Name  Age
0   1  Alice   25
1   2    Bob   30
2   6    NaN   35
3   7    NaN   40
4   8    NaN   45

In [69]:
df=pd.DataFrame(
    {
        "A": ["Hey","Hii","Hey","Hii","Hey","Hii","Hey","Hey"],
        "B": ["One","Two","Three","One","Two","Three","One","Two"],
        "C": np.random.randn(8),
        "D": np.random.rand(8),
    }
)

In [70]:
df

     A      B         C         D
0  Hey    One  0.541948  0.333658
1  Hii    Two -0.445381  0.666239
2  Hey  Three  0.424313  0.879252
3  Hii    One -0.459616  0.251496
4  Hey    Two  0.699229  0.103450
5  Hii  Three -0.090583  0.651821
6  Hey    One  0.185629  0.092098
7  Hey    Two  0.883217  0.847918

In [71]:
df.groupby("B")[["C","D"]].sum()

              C         D
B
One    0.267960  0.677252
Three  0.333730  1.531073
Two    1.137065  1.617607

In [72]:
df.groupby(["A","D"]).sum()

                  B         C
A   D
Hey 0.092098    One  0.185629
    0.103450    Two  0.699229
    0.333658    One  0.541948
    0.847918    Two  0.883217
    0.879252  Three  0.424313
Hii 0.251496    One -0.459616
    0.651821  Three -0.090583
    0.666239    Two -0.445381

In [73]:
data={
    "A": [1,5,7],
    "B": [2,8,7],
}
data

df= pd.DataFrame(data, index=['Row1', 'Row2', 'Row3'])
print(df)

stack= df.stack()
print(stack)

      A  B
Row1  1  2
Row2  5  8
Row3  7  7
Row1  A    1
      B    2
Row2  A    5
      B    8
Row3  A    7
      B    7
dtype: int64

In [74]:
data= {
        "Date": ["19-07-2024","19-07-2024","21-07-2024","21-07-2024",],
        "City": ["Noida","Ahmedabad","Noida","Ahmedabad"],
        "Temp": ["25","35","30","28"],
    }
df =pd.DataFrame(data)
print(df)

PT= df.pivot_table(index='Date', columns='City', values='Temp', aggfunc='sum')

         Date       City Temp
0  19-07-2024      Noida   25
1  19-07-2024  Ahmedabad   35
2  21-07-2024      Noida   30
3  21-07-2024  Ahmedabad   28

In [75]:
PT

City       Ahmedabad Noida
Date
19-07-2024        35    25
21-07-2024        28    30

In [76]:
A= pd.date_range(start='2024-01-01', end='2024-01-15')
df= pd.DataFrame(np.random.randn(15), index=A, columns=['Values'])
print(df)

              Values
2024-01-01 -1.044240
2024-01-02 -0.078979
2024-01-03  0.840876
2024-01-04  0.434255
2024-01-05  1.989800
2024-01-06 -1.295573
2024-01-07  0.525260
2024-01-08 -1.367937
2024-01-09 -0.862184
2024-01-10  1.315205
2024-01-11 -0.488390
2024-01-12  0.127072
2024-01-13  1.366130
2024-01-14 -1.362360
2024-01-15 -0.989809

In [77]:
C= ["A","B","C","A","B","C"]

A= pd.Series(C, dtype='category')

A

0    A
1    B
2    C
3    A
4    B
5    C
dtype: category
Categories (3, object): ['A', 'B', 'C']

In [2]:
df= pd.read_clipboard()
df

          Date;Event;Cost
0   10/2/2011;Music;10000
1  11/2/2011;Poetry;12000
2  12/2/2011;Theatre;5000
3   13/2/2011;Comedy;8000